
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       BE—Basic Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 6-user network perpetual
Serial number: 501706335292
  Licensed to: Miklos Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do code/create/manager_country.do 

. clear all

. here
/srv/sandbox/zavecz/dropbox_encrypted/expat-dyadic/

. local here = r(here)

. use "`here'/input/ceo-panel/ceo-panel.dta", clear

. 
. rename person_id manager_id

. 
. * same manager with multiple countries changed to mode country
. tab country_code expat, missing

country_co |         expat
        de |         0          1 |     Total
-----------+----------------------+----------
           |11,616,430    241,696 |11,858,126 
        AD |         0         39 |        39 
        AE |         0      1,196 |     1,196 
        AF |         0         99 |        99 
        AG |         0         10 |        10 
        AL |         0        387 |       387 
        AM |         0        657 |       657 
        AN |         0        263 |       263 
        AO |         0         41 |        41 
        AR |         0        296 |       296 
        AS |         0         67 |        67 
        AT |         0     98,064 |    98,064 
        AU |         0      3,082 |     3,082 
        AZ |         0        246 |       246 
        BA |         0      1,377 |     1,377 
        BB |         0         55 |        55 
        BD |         0         63 |        63 
        BE |         0      9,447 |     9,447 
        BF |         0          2 |         2 
        BG |         0      2,675 |     2,675 
        BH |         0        571 |       571 
        BI |         0         22 |        22 
        BJ |         0          5 |         5 
        BL |         0         23 |        23 
        BM |         0         32 |        32 
        BN |         0         20 |        20 
        BO |         0        153 |       153 
        BR |         0        570 |       570 
        BS |         0        118 |       118 
        BT |         0         62 |        62 
        BW |         0         19 |        19 
        BY |         0        818 |       818 
        BZ |         0         37 |        37 
        CA |         0      6,226 |     6,226 
        CD |         0         36 |        36 
        CF |         0          2 |         2 
        CG |         0         32 |        32 
        CH |         0     18,447 |    18,447 
        CI |         0          9 |         9 
        CL |         0         96 |        96 
        CM |         0        110 |       110 
        CN |         0     82,642 |    82,642 
        CO |         0        143 |       143 
        CR |         0        336 |       336 
        CS |         0        319 |       319 
        CU |         0         83 |        83 
        CY |         0        923 |       923 
        CZ |         0      8,975 |     8,975 
        DE |         0    113,850 |   113,850 
        DK |         0      2,205 |     2,205 
        DM |         0         70 |        70 
        DO |         0         86 |        86 
        DZ |         0        779 |       779 
        EC |         0         73 |        73 
        EE |         0        316 |       316 
        EG |         0      2,340 |     2,340 
        ER |         0          7 |         7 
        ES |         0      8,365 |     8,365 
        ET |         0        214 |       214 
        FI |         0      2,100 |     2,100 
        FR |         0     13,811 |    13,811 
        GA |         0         36 |        36 
        GB |         0     22,922 |    22,922 
        GD |         0         13 |        13 
        GE |         0        704 |       704 
        GF |         0          9 |         9 
        GG |         0          5 |         5 
        GH |         0         54 |        54 
        GI |         0         23 |        23 
        GM |         0         20 |        20 
        GN |         0        106 |       106 
        GQ |         0          1 |         1 
        GR |         0      2,514 |     2,514 
        GT |         0         14 |        14 
        GU |         0          7 |         7 
        GW |         0         61 |        61 
        GY |         0         34 |        34 
        HK |         0        733 |       733 
        HN |         0         22 |        22 
        HR |         0     10,601 |    10,601 
        HU |       691          0 |       691 
        ID |         0        177 |       177 
        IE |         0     11,061 |    11,061 
        IL |         0     24,659 |    24,659 
        IN |         0      2,428 |     2,428 
        IQ |         0        408 |       408 
        IR |         0      2,378 |     2,378 
        IS |         0        831 |       831 
        IT |         0     39,584 |    39,584 
        JM |         0         11 |        11 
        JO |         0        866 |       866 
        JP |         0      2,665 |     2,665 
        KE |         0         31 |        31 
        KG |         0         53 |        53 
        KH |         0         93 |        93 
        KI |         0         20 |        20 
        KN |         0         22 |        22 
        KP |         0         31 |        31 
        KR |         0      1,472 |     1,472 
        KW |         0        239 |       239 
        KY |         0         20 |        20 
        KZ |         0      1,750 |     1,750 
        LA |         0          2 |         2 
        LB |         0        603 |       603 
        LI |         0        570 |       570 
        LK |         0         34 |        34 
        LR |         0         43 |        43 
        LS |         0         11 |        11 
        LT |         0        835 |       835 
        LU |         0      1,176 |     1,176 
        LV |         0        574 |       574 
        LY |         0        593 |       593 
        MA |         0        159 |       159 
        MC |         0        316 |       316 
        MD |         0        953 |       953 
        ME |         0         37 |        37 
        MG |         0         38 |        38 
        MK |         0      1,227 |     1,227 
        ML |         0         14 |        14 
        MM |         0         30 |        30 
        MN |         0      1,683 |     1,683 
        MO |         0        158 |       158 
        MR |         0          2 |         2 
        MS |         0          7 |         7 
        MT |         0        370 |       370 
        MU |         0         72 |        72 
        MX |         0        166 |       166 
        MY |         0        304 |       304 
        MZ |         0         13 |        13 
        NC |         0         21 |        21 
        NE |         0        226 |       226 
        NG |         0        792 |       792 
        NI |         0        102 |       102 
        NL |         0     22,241 |    22,241 
        NO |         0      1,111 |     1,111 
        NP |         0         56 |        56 
        NR |         0          7 |         7 
        NZ |         0        188 |       188 
        OM |         0         61 |        61 
        PA |         0         93 |        93 
        PE |         0         60 |        60 
        PH |         0        147 |       147 
        PK |         0        528 |       528 
        PL |         0      8,374 |     8,374 
        PS |         0         11 |        11 
        PT |         0      1,204 |     1,204 
        PY |         0         23 |        23 
        QA |         0        100 |       100 
        RE |         0         12 |        12 
        RO |         0     99,047 |    99,047 
        RS |         0     65,268 |    65,268 
        RU |         0     35,624 |    35,624 
        SA |         0        236 |       236 
        SB |         0        584 |       584 
        SC |         0        227 |       227 
        SD |         0         94 |        94 
        SE |         0      6,355 |     6,355 
        SG |         0        569 |       569 
        SI |         0      2,280 |     2,280 
        SK |         0     25,094 |    25,094 
        SL |         0      1,381 |     1,381 
        SM |         0      1,485 |     1,485 
        SN |         0         64 |        64 
        SO |         0        141 |       141 
        SR |         0      4,597 |     4,597 
        ST |         0          6 |         6 
        SV |         0        181 |       181 
        SY |         0      3,860 |     3,860 
        SZ |         0         35 |        35 
        TD |         0          2 |         2 
        TG |         0         70 |        70 
        TH |         0        419 |       419 
        TJ |         0         16 |        16 
        TM |         0         14 |        14 
        TN |         0        255 |       255 
        TO |         0         13 |        13 
        TR |         0      8,079 |     8,079 
        TT |         0         40 |        40 
        TW |         0        576 |       576 
        TZ |         0         69 |        69 
        UA |         0     54,897 |    54,897 
        UG |         0         11 |        11 
        US |         0     22,075 |    22,075 
        UY |         0         69 |        69 
        UZ |         0        228 |       228 
        VA |         0        119 |       119 
        VE |         0        149 |       149 
        VN |         0     10,631 |    10,631 
        VU |         0          8 |         8 
        WS |         0          1 |         1 
        XK |         0         12 |        12 
        YE |         0         37 |        37 
        ZA |         0        553 |       553 
        ZM |         0          7 |         7 
        ZW |         0         19 |        19 
-----------+----------------------+----------
     Total |11,617,121  1,142,329 |12,759,450 

. bys frame_id_numeric manager_id: egen country_code_fill = mode(country_code),
>  minmode
warning: For at least one group, country_code contains all missing values.
         Generating missing values for the modes in these groups. Use option
         missing to treat missing values as a category.
(11,776,229 missing values generated)

. tab country_code_fill expat, missing

country_co |         expat
   de_fill |         0          1 |     Total
-----------+----------------------+----------
           |11,615,728    160,501 |11,776,229 
        AD |         0         67 |        67 
        AE |         0      1,488 |     1,488 
        AF |         0        138 |       138 
        AG |         0          5 |         5 
        AL |         0        497 |       497 
        AM |         0        788 |       788 
        AN |         0        118 |       118 
        AO |         0         42 |        42 
        AR |         0        348 |       348 
        AS |         0         58 |        58 
        AT |        26    105,661 |   105,687 
        AU |         0      3,420 |     3,420 
        AZ |         0        275 |       275 
        BA |         0      1,576 |     1,576 
        BB |         0         60 |        60 
        BD |         0         71 |        71 
        BE |         0     10,143 |    10,143 
        BF |         0          2 |         2 
        BG |         0      2,986 |     2,986 
        BH |         0        664 |       664 
        BI |         0         22 |        22 
        BJ |         0          5 |         5 
        BL |         0         23 |        23 
        BM |         0         35 |        35 
        BN |         0         14 |        14 
        BO |         0        176 |       176 
        BR |         0        631 |       631 
        BS |         0        126 |       126 
        BT |         0         64 |        64 
        BW |         0         19 |        19 
        BY |         0        921 |       921 
        BZ |         0         43 |        43 
        CA |        15      7,142 |     7,157 
        CD |         0         33 |        33 
        CF |         0          2 |         2 
        CG |         0         37 |        37 
        CH |         6     20,543 |    20,549 
        CI |         0          9 |         9 
        CL |         0        101 |       101 
        CM |         0        117 |       117 
        CN |         0     95,961 |    95,961 
        CO |         0        191 |       191 
        CR |         0        324 |       324 
        CS |         0        308 |       308 
        CU |         0         79 |        79 
        CY |         6        995 |     1,001 
        CZ |         0      9,368 |     9,368 
        DE |        40    123,084 |   123,124 
        DK |         0      2,354 |     2,354 
        DM |         0         68 |        68 
        DO |         0         85 |        85 
        DZ |         0        829 |       829 
        EC |         0         75 |        75 
        EE |         0        313 |       313 
        EG |         0      2,581 |     2,581 
        ER |         0         15 |        15 
        ES |         0      8,949 |     8,949 
        ET |         0        243 |       243 
        FI |         0      2,402 |     2,402 
        FR |         0     15,124 |    15,124 
        GA |         0         36 |        36 
        GB |         5     25,225 |    25,230 
        GD |         0          4 |         4 
        GE |         0        812 |       812 
        GF |         0          9 |         9 
        GG |         0          5 |         5 
        GH |         0         85 |        85 
        GI |         0         20 |        20 
        GM |         0         18 |        18 
        GN |         0        142 |       142 
        GQ |         0          1 |         1 
        GR |        11      2,784 |     2,795 
        GT |         0         19 |        19 
        GU |         0         12 |        12 
        GW |         0         93 |        93 
        GY |         0         40 |        40 
        HK |         0        765 |       765 
        HN |         0         19 |        19 
        HR |         0     11,293 |    11,293 
        HU |       839          0 |       839 
        ID |         0        177 |       177 
        IE |         0     11,408 |    11,408 
        IL |         0     26,701 |    26,701 
        IN |         0      2,746 |     2,746 
        IQ |         0        426 |       426 
        IR |         1      2,668 |     2,669 
        IS |         0        815 |       815 
        IT |        16     42,946 |    42,962 
        JM |         0         11 |        11 
        JO |         0        908 |       908 
        JP |         0      3,004 |     3,004 
        KE |         0         26 |        26 
        KG |         0         58 |        58 
        KH |         0        118 |       118 
        KI |         0         17 |        17 
        KN |         0         22 |        22 
        KP |         0         26 |        26 
        KR |         0      1,670 |     1,670 
        KW |         0        233 |       233 
        KY |         0         32 |        32 
        KZ |         0      1,804 |     1,804 
        LA |         0          5 |         5 
        LB |         0        630 |       630 
        LI |         0        644 |       644 
        LK |         0         42 |        42 
        LR |         0         45 |        45 
        LS |         0         13 |        13 
        LT |         0        867 |       867 
        LU |        10      1,223 |     1,233 
        LV |         0        591 |       591 
        LY |         0        624 |       624 
        MA |         0        180 |       180 
        MC |         6        340 |       346 
        MD |         0        968 |       968 
        ME |         0         29 |        29 
        MG |         0         38 |        38 
        MK |         0      1,267 |     1,267 
        ML |         0         14 |        14 
        MM |         0         34 |        34 
        MN |         0      1,781 |     1,781 
        MO |         0        169 |       169 
        MR |         0          2 |         2 
        MS |         0          7 |         7 
        MT |         0        446 |       446 
        MU |         0         82 |        82 
        MX |         0        170 |       170 
        MY |         0        320 |       320 
        MZ |         0         23 |        23 
        NC |         0         19 |        19 
        NE |         0        291 |       291 
        NG |         0        884 |       884 
        NI |         0         99 |        99 
        NL |         7     23,666 |    23,673 
        NO |         0      1,248 |     1,248 
        NP |         0         71 |        71 
        NZ |         0        243 |       243 
        OM |         0         61 |        61 
        PA |         0        112 |       112 
        PE |         0         69 |        69 
        PH |         0        161 |       161 
        PK |         0        536 |       536 
        PL |         0      8,915 |     8,915 
        PS |         0          7 |         7 
        PT |         0      1,257 |     1,257 
        PY |         0         34 |        34 
        QA |         0        104 |       104 
        RE |         0         12 |        12 
        RO |       239    106,331 |   106,570 
        RS |        66     71,376 |    71,442 
        RU |         6     37,788 |    37,794 
        SA |         0        234 |       234 
        SB |         0        587 |       587 
        SC |         0        268 |       268 
        SD |         0         99 |        99 
        SE |         0      7,126 |     7,126 
        SG |         2        633 |       635 
        SI |         0      2,395 |     2,395 
        SK |        26     27,544 |    27,570 
        SL |         0      1,476 |     1,476 
        SM |         0      1,564 |     1,564 
        SN |         0         70 |        70 
        SO |         0        146 |       146 
        SR |         0      4,766 |     4,766 
        ST |         0          7 |         7 
        SV |         0        181 |       181 
        SY |        11      4,396 |     4,407 
        SZ |         0         30 |        30 
        TD |         0          2 |         2 
        TG |         0         75 |        75 
        TH |         0        464 |       464 
        TJ |         0         16 |        16 
        TM |         0         15 |        15 
        TN |         0        298 |       298 
        TO |         0         13 |        13 
        TR |         0      9,231 |     9,231 
        TT |         0         40 |        40 
        TW |         0        662 |       662 
        TZ |         0         72 |        72 
        UA |        47     56,624 |    56,671 
        UG |         0         11 |        11 
        US |         0     24,324 |    24,324 
        UY |         0         83 |        83 
        UZ |         0        221 |       221 
        VA |         0        121 |       121 
        VE |         0        170 |       170 
        VN |         0     14,307 |    14,307 
        VU |         0          8 |         8 
        WS |         0          1 |         1 
        XK |         0         13 |        13 
        YE |         0         46 |        46 
        ZA |         8        597 |       605 
        ZM |         0          7 |         7 
        ZW |         0         31 |        31 
-----------+----------------------+----------
     Total |11,617,121  1,142,329 |12,759,450 

. 
. * same manager with multiple countries changed to mode country
. bys manager_id: egen country_code_fill_manager = mode(country_code), minmode
warning: For at least one group, country_code contains all missing values.
         Generating missing values for the modes in these groups. Use option
         missing to treat missing values as a category.
(11,689,456 missing values generated)

. tab country_code_fill_manager expat, missing

country_co |
de_fill_ma |         expat
     nager |         0          1 |     Total
-----------+----------------------+----------
           |11,597,580     91,876 |11,689,456 
        AD |         0         86 |        86 
        AE |       104      1,738 |     1,842 
        AF |         0        141 |       141 
        AG |         0          4 |         4 
        AL |        14        576 |       590 
        AM |         1        850 |       851 
        AN |         0        113 |       113 
        AO |         0         42 |        42 
        AR |         0        438 |       438 
        AS |         0         76 |        76 
        AT |     1,221    110,469 |   111,690 
        AU |        70      3,862 |     3,932 
        AZ |         0        288 |       288 
        BA |         6      1,661 |     1,667 
        BB |         0         60 |        60 
        BD |         0         72 |        72 
        BE |        79     10,466 |    10,545 
        BF |         0          2 |         2 
        BG |        25      3,052 |     3,077 
        BH |         0        746 |       746 
        BI |         0         29 |        29 
        BJ |         0          5 |         5 
        BL |         0         23 |        23 
        BM |         0         35 |        35 
        BN |         0          9 |         9 
        BO |         0        180 |       180 
        BR |        22        653 |       675 
        BS |         0        158 |       158 
        BT |         0         60 |        60 
        BW |         0         19 |        19 
        BY |         0      1,001 |     1,001 
        BZ |         0         45 |        45 
        CA |       281      7,980 |     8,261 
        CD |         0         30 |        30 
        CF |         0          2 |         2 
        CG |         0         39 |        39 
        CH |       482     22,795 |    23,277 
        CI |         0         12 |        12 
        CL |         0        101 |       101 
        CM |         0        111 |       111 
        CN |        76    110,940 |   111,016 
        CO |         0        236 |       236 
        CR |         0        316 |       316 
        CS |         0        334 |       334 
        CU |         0         83 |        83 
        CY |        57      1,076 |     1,133 
        CZ |        28      9,506 |     9,534 
        DE |     2,531    128,934 |   131,465 
        DK |        30      2,498 |     2,528 
        DM |         1         83 |        84 
        DO |         0         85 |        85 
        DZ |        22        887 |       909 
        EC |         0         75 |        75 
        EE |         0        327 |       327 
        EG |         5      2,717 |     2,722 
        ER |         0         15 |        15 
        ES |       135      9,812 |     9,947 
        ET |         0        251 |       251 
        FI |        12      2,453 |     2,465 
        FR |       126     15,886 |    16,012 
        GA |         0         36 |        36 
        GB |       444     28,024 |    28,468 
        GD |         0          4 |         4 
        GE |        41        915 |       956 
        GF |         0          9 |         9 
        GG |         0          5 |         5 
        GH |        27        102 |       129 
        GI |         0         18 |        18 
        GM |         0         10 |        10 
        GN |         9        191 |       200 
        GQ |         0          1 |         1 
        GR |        11      3,068 |     3,079 
        GT |        17         38 |        55 
        GU |        85         22 |       107 
        GW |         7        134 |       141 
        GY |         0         40 |        40 
        HK |         0        782 |       782 
        HN |         0         25 |        25 
        HR |        95     11,767 |    11,862 
        HU |     2,986         10 |     2,996 
        ID |        16        216 |       232 
        IE |        20     11,754 |    11,774 
        IL |       337     29,497 |    29,834 
        IN |         1      2,999 |     3,000 
        IQ |         0        441 |       441 
        IR |         1      2,739 |     2,740 
        IS |        14        871 |       885 
        IT |       234     45,428 |    45,662 
        JM |         0         11 |        11 
        JO |         0        942 |       942 
        JP |         3      3,085 |     3,088 
        KE |         0         26 |        26 
        KG |         0         58 |        58 
        KH |         0        139 |       139 
        KI |         0         17 |        17 
        KN |         0         14 |        14 
        KP |         0         23 |        23 
        KR |         0      1,782 |     1,782 
        KW |         0        240 |       240 
        KY |         0         69 |        69 
        KZ |         7      1,808 |     1,815 
        LA |         0          5 |         5 
        LB |         0        641 |       641 
        LI |         8        722 |       730 
        LK |         0         42 |        42 
        LR |         0         45 |        45 
        LS |         0         27 |        27 
        LT |         0        876 |       876 
        LU |        29      1,315 |     1,344 
        LV |         0        615 |       615 
        LY |         0        642 |       642 
        MA |        16        240 |       256 
        MC |         8        355 |       363 
        MD |         5        977 |       982 
        ME |         0         35 |        35 
        MG |         0         42 |        42 
        MK |         0      1,277 |     1,277 
        ML |         0         14 |        14 
        MM |         0         29 |        29 
        MN |         0      1,883 |     1,883 
        MO |         0        173 |       173 
        MR |         0          2 |         2 
        MS |         0          6 |         6 
        MT |        21        632 |       653 
        MU |         0         87 |        87 
        MX |         0        173 |       173 
        MY |         0        345 |       345 
        MZ |         0         23 |        23 
        NC |         0         14 |        14 
        NE |         0        291 |       291 
        NG |         0        996 |       996 
        NI |         0         99 |        99 
        NL |        90     24,764 |    24,854 
        NO |        70      1,281 |     1,351 
        NP |         0         71 |        71 
        NZ |         0        341 |       341 
        OM |         1         65 |        66 
        PA |         0        121 |       121 
        PE |         0         70 |        70 
        PH |         2        187 |       189 
        PK |         8        536 |       544 
        PL |         5      9,092 |     9,097 
        PS |         0          7 |         7 
        PT |         0      1,242 |     1,242 
        PY |        10         28 |        38 
        QA |         0        104 |       104 
        RE |         0         12 |        12 
        RO |     3,085    111,825 |   114,910 
        RS |     3,382     75,686 |    79,068 
        RU |       340     38,551 |    38,891 
        SA |         0        232 |       232 
        SB |         6        558 |       564 
        SC |         0        268 |       268 
        SD |         0         99 |        99 
        SE |       305      7,538 |     7,843 
        SG |         5        748 |       753 
        SI |        27      2,638 |     2,665 
        SK |     1,028     31,070 |    32,098 
        SL |        26      1,449 |     1,475 
        SM |        46      1,641 |     1,687 
        SN |         0         84 |        84 
        SO |         0        159 |       159 
        SR |        63      5,301 |     5,364 
        ST |         0          4 |         4 
        SV |         6        227 |       233 
        SY |       112      4,703 |     4,815 
        SZ |         0         34 |        34 
        TD |         0          2 |         2 
        TG |         0         75 |        75 
        TH |         0        487 |       487 
        TJ |         0         16 |        16 
        TM |         0         15 |        15 
        TN |         0        345 |       345 
        TO |         0         29 |        29 
        TR |        14      9,872 |     9,886 
        TT |         0         35 |        35 
        TW |         0        707 |       707 
        TZ |         0         72 |        72 
        UA |       632     58,327 |    58,959 
        UG |         0         11 |        11 
        US |       463     26,344 |    26,807 
        UY |        15        105 |       120 
        UZ |         0        222 |       222 
        VA |         0        127 |       127 
        VE |         0        201 |       201 
        VN |         0     17,452 |    17,452 
        VU |         0          8 |         8 
        WS |         0          1 |         1 
        XK |         0         17 |        17 
        YE |         0         56 |        56 
        ZA |        30        627 |       657 
        ZM |         0          7 |         7 
        ZW |         0         31 |        31 
-----------+----------------------+----------
     Total |11,617,121  1,142,329 |12,759,450 

. 
. * propagate country code for known names
. replace country_code = country_code_fill if missing(country_code) & !missing(
> country_code_fill)
(81,897 real changes made)

. replace country_code = country_code_fill_manager if missing(country_code) & !
> missing(country_code_fill_manager)
(86,773 real changes made)

. 
. drop if missing(country_code)
(11,689,456 observations deleted)

. * merge some easy-to-mix languages
. replace iso639 = "sk" if iso639 == "cs"
(34 real changes made)

. replace iso639 = "ru" if inlist(iso639, "bg", "uk", "sq")
(29 real changes made)

. replace iso639 = "sr" if inlist(iso639, "hr")
(6 real changes made)

. replace iso639 = "sv" if inlist(iso639, "no")
(22 real changes made)

. replace iso639 = "vi" if inlist(iso639, "th")
(0 real changes made)

. * flag non-expats as hungarian
. replace iso639 = "hu" if expat == 0
(19,541 real changes made)

. * NB: remove country-related languages
. levelsof iso639
`"ar"' `"de"' `"el"' `"en"' `"es"' `"fi"' `"fr"' `"he"' `"hi"' `"hu"' `"it"' `"
> ja"' `"ko"' `"nl"' `"pl"' `"pt"' `"ro"' `"ru"' `"sk"' `"sr"' `"sv"' `"tr"' `"
> vi"' `"zh"'

. local languages = r(levels)

. foreach lang in `languages' {
  2.         * add language inferred from name
.         generate byte cnt_`lang' = (iso639 == "`lang'")
  3. }

. 
. collapse (max) expat cnt_??, by(frame_id_numeric year country_code)

. drop expat

. 
. * convert YU country codes
. do "`here'/code/util/yugoslavia.do"

. local yugoslavia YU XS RS XM HR BA SI CS MK XK ME

. local ussr SU AM AZ BY GE KG KZ MD TJ TM UA UZ 

. 
. * Cannot separate Serbia and Montenegro, Kosovo
. replace country = "YU" if inlist(country, "XS", "XM", "CS", "RS", "XK", "ME")
(62,627 real changes made)

. 
. 
end of do-file

. 
. * adding all language codes for one firm-year into one variable
. generate str language_list = ""
(880,498 missing values generated)

. foreach language of var cnt_?? {
  2.         local lng = substr("`language'", 5, 2)
  3.         display "`lng'"
  4.         tempvar cnt
  5.         egen `cnt' = max(`language'), by(frame_id_numeric year)
  6.         replace language_list = language_list + "`lng'," if `cnt' == 1
  7.         drop `cnt'
  8. }
ar
variable language_list was str1 now str3
(17 real changes made)
de
(3,844 real changes made)
el
(51 real changes made)
en
variable language_list was str3 now str6
(559 real changes made)
es
(52 real changes made)
fi
(39 real changes made)
fr
variable language_list was str6 now str9
(214 real changes made)
he
(144 real changes made)
hi
(11 real changes made)
hu
(20,496 real changes made)
it
(932 real changes made)
ja
(14 real changes made)
ko
(52 real changes made)
nl
(335 real changes made)
pl
(176 real changes made)
pt
(1 real change made)
ro
(94 real changes made)
ru
(184 real changes made)
sk
(223 real changes made)
sr
(158 real changes made)
sv
(90 real changes made)
tr
(84 real changes made)
vi
(331 real changes made)
zh
(58 real changes made)

. 
. * adding all country codes for one firm-year into one variable
. generate str country_list = ""
(880,498 missing values generated)

. levelsof country_code
`"AD"' `"AE"' `"AF"' `"AG"' `"AL"' `"AM"' `"AN"' `"AO"' `"AR"' `"AS"' `"AT"' `"
> AU"' `"AZ"' `"BA"' `"BB"' `"BD"' `"BE"' `"BF"' `"BG"' `"BH"' `"BI"' `"BJ"' `"
> BL"' `"BM"' `"BN"' `"BO"' `"BR"' `"BS"' `"BT"' `"BW"' `"BY"' `"BZ"' `"CA"' `"
> CD"' `"CF"' `"CG"' `"CH"' `"CI"' `"CL"' `"CM"' `"CN"' `"CO"' `"CR"' `"CU"' `"
> CY"' `"CZ"' `"DE"' `"DK"' `"DM"' `"DO"' `"DZ"' `"EC"' `"EE"' `"EG"' `"ER"' `"
> ES"' `"ET"' `"FI"' `"FR"' `"GA"' `"GB"' `"GD"' `"GE"' `"GF"' `"GG"' `"GH"' `"
> GI"' `"GM"' `"GN"' `"GQ"' `"GR"' `"GT"' `"GU"' `"GW"' `"GY"' `"HK"' `"HN"' `"
> HR"' `"HU"' `"ID"' `"IE"' `"IL"' `"IN"' `"IQ"' `"IR"' `"IS"' `"IT"' `"JM"' `"
> JO"' `"JP"' `"KE"' `"KG"' `"KH"' `"KI"' `"KN"' `"KP"' `"KR"' `"KW"' `"KY"' `"
> KZ"' `"LA"' `"LB"' `"LI"' `"LK"' `"LR"' `"LS"' `"LT"' `"LU"' `"LV"' `"LY"' `"
> MA"' `"MC"' `"MD"' `"MG"' `"MK"' `"ML"' `"MM"' `"MN"' `"MO"' `"MR"' `"MS"' `"
> MT"' `"MU"' `"MX"' `"MY"' `"MZ"' `"NC"' `"NE"' `"NG"' `"NI"' `"NL"' `"NO"' `"
> NP"' `"NR"' `"NZ"' `"OM"' `"PA"' `"PE"' `"PH"' `"PK"' `"PL"' `"PS"' `"PT"' `"
> PY"' `"QA"' `"RE"' `"RO"' `"RU"' `"SA"' `"SB"' `"SC"' `"SD"' `"SE"' `"SG"' `"
> SI"' `"SK"' `"SL"' `"SM"' `"SN"' `"SO"' `"SR"' `"ST"' `"SV"' `"SY"' `"SZ"' `"
> TD"' `"TG"' `"TH"' `"TJ"' `"TM"' `"TN"' `"TO"' `"TR"' `"TT"' `"TW"' `"TZ"' `"
> UA"' `"UG"' `"US"' `"UY"' `"UZ"' `"VA"' `"VE"' `"VN"' `"VU"' `"WS"' `"YE"' `"
> YU"' `"ZA"' `"ZM"' `"ZW"'

. local countries = r(levels)

. foreach country in `countries' {
  2.         display "`country'"
  3.         tempvar cnt
  4.         egen `cnt' = max(country_code == "`country'"), by(frame_id_numeric
>  year)
  5.         replace country_list = country_list + "`country'," if `cnt' == 1
  6.         drop `cnt'
  7. }
AD
variable country_list was str1 now str3
(94 real changes made)
AE
(1,823 real changes made)
AF
(134 real changes made)
AG
(17 real changes made)
AL
variable country_list was str3 now str6
(571 real changes made)
AM
(601 real changes made)
AN
(159 real changes made)
AO
(41 real changes made)
AR
(431 real changes made)
AS
(84 real changes made)
AT
(97,074 real changes made)
AU
(4,188 real changes made)
AZ
(242 real changes made)
BA
(1,594 real changes made)
BB
(67 real changes made)
BD
(74 real changes made)
BE
(10,108 real changes made)
BF
(2 real changes made)
BG
(3,003 real changes made)
BH
(704 real changes made)
BI
(32 real changes made)
BJ
(5 real changes made)
BL
(46 real changes made)
BM
(35 real changes made)
BN
(21 real changes made)
BO
(187 real changes made)
BR
(634 real changes made)
BS
(128 real changes made)
BT
(81 real changes made)
BW
(38 real changes made)
BY
(887 real changes made)
BZ
(45 real changes made)
CA
(8,500 real changes made)
CD
(36 real changes made)
CF
(2 real changes made)
CG
(32 real changes made)
CH
variable country_list was str6 now str9
(23,157 real changes made)
CI
(12 real changes made)
CL
(80 real changes made)
CM
(118 real changes made)
CN
(70,378 real changes made)
CO
(262 real changes made)
CR
(362 real changes made)
CU
(112 real changes made)
CY
(1,149 real changes made)
CZ
(9,989 real changes made)
DE
(119,474 real changes made)
DK
(2,432 real changes made)
DM
(100 real changes made)
DO
(86 real changes made)
DZ
(793 real changes made)
EC
(75 real changes made)
EE
(364 real changes made)
EG
(2,453 real changes made)
ER
(24 real changes made)
ES
(7,960 real changes made)
ET
(161 real changes made)
FI
(2,192 real changes made)
FR
variable country_list was str9 now str12
(15,642 real changes made)
GA
(38 real changes made)
GB
(28,907 real changes made)
GD
(14 real changes made)
GE
(874 real changes made)
GF
(9 real changes made)
GG
(5 real changes made)
GH
(144 real changes made)
GI
(28 real changes made)
GM
(30 real changes made)
GN
(176 real changes made)
GQ
(1 real change made)
GR
(2,961 real changes made)
GT
(53 real changes made)
GU
(111 real changes made)
GW
(129 real changes made)
GY
(40 real changes made)
HK
(896 real changes made)
HN
(40 real changes made)
HR
(10,598 real changes made)
HU
(3,000 real changes made)
ID
(227 real changes made)
IE
(10,545 real changes made)
IL
(27,077 real changes made)
IN
(2,783 real changes made)
IQ
(439 real changes made)
IR
(2,448 real changes made)
IS
(1,027 real changes made)
IT
(40,146 real changes made)
JM
(11 real changes made)
JO
(861 real changes made)
JP
(2,376 real changes made)
KE
(36 real changes made)
KG
(58 real changes made)
KH
(146 real changes made)
KI
(12 real changes made)
KN
(22 real changes made)
KP
(28 real changes made)
KR
(1,628 real changes made)
KW
(198 real changes made)
KY
(153 real changes made)
KZ
(1,682 real changes made)
LA
(10 real changes made)
LB
(554 real changes made)
LI
(726 real changes made)
LK
(38 real changes made)
LR
(53 real changes made)
LS
(23 real changes made)
LT
(840 real changes made)
LU
(1,730 real changes made)
LV
(619 real changes made)
LY
(571 real changes made)
MA
(282 real changes made)
MC
(444 real changes made)
MD
(1,059 real changes made)
MG
(42 real changes made)
MK
(1,209 real changes made)
ML
(14 real changes made)
MM
(42 real changes made)
MN
(1,382 real changes made)
MO
(166 real changes made)
MR
(2 real changes made)
MS
(8 real changes made)
MT
(664 real changes made)
MU
(87 real changes made)
MX
(193 real changes made)
MY
(344 real changes made)
MZ
(23 real changes made)
NC
(38 real changes made)
NE
(314 real changes made)
NG
(948 real changes made)
NI
(110 real changes made)
NL
variable country_list was str12 now str15
(21,204 real changes made)
NO
(1,442 real changes made)
NP
(68 real changes made)
NR
(13 real changes made)
NZ
(410 real changes made)
OM
(88 real changes made)
PA
(133 real changes made)
PE
(79 real changes made)
PH
(247 real changes made)
PK
(491 real changes made)
PL
(8,880 real changes made)
PS
(11 real changes made)
PT
(892 real changes made)
PY
(43 real changes made)
QA
(76 real changes made)
RE
(6 real changes made)
RO
(98,761 real changes made)
RU
(32,607 real changes made)
SA
(266 real changes made)
SB
(624 real changes made)
SC
(282 real changes made)
SD
(111 real changes made)
SE
(7,499 real changes made)
SG
(885 real changes made)
SI
(2,553 real changes made)
SK
(30,409 real changes made)
SL
(1,659 real changes made)
SM
(1,699 real changes made)
SN
(91 real changes made)
SO
(171 real changes made)
SR
(5,511 real changes made)
ST
(6 real changes made)
SV
(258 real changes made)
SY
(3,960 real changes made)
SZ
(35 real changes made)
TD
(2 real changes made)
TG
(90 real changes made)
TH
(464 real changes made)
TJ
(16 real changes made)
TM
(12 real changes made)
TN
(333 real changes made)
TO
(40 real changes made)
TR
(7,817 real changes made)
TT
(31 real changes made)
TW
(660 real changes made)
TZ
(90 real changes made)
UA
(55,239 real changes made)
UG
(13 real changes made)
US
(26,964 real changes made)
UY
(138 real changes made)
UZ
(166 real changes made)
VA
(177 real changes made)
VE
(219 real changes made)
VN
(13,299 real changes made)
VU
(8 real changes made)
WS
(1 real change made)
YE
(60 real changes made)
YU
(63,869 real changes made)
ZA
(702 real changes made)
ZM
(14 real changes made)
ZW
(29 real changes made)

. bysort frame_id_numeric year: generate keep = (_n==1)

. keep if keep
(24,996 observations deleted)

. keep frame_id_numeric year country_list language_list

. 
. compress
  (0 bytes saved)

. save "`here'/temp/manager_country.dta", replace
(file
    /srv/sandbox/zavecz/dropbox_encrypted/expat-dyadic//temp/manager_country.
    > dta not found)
file
    /srv/sandbox/zavecz/dropbox_encrypted/expat-dyadic//temp/manager_country.
    > dta saved

. 
end of do-file
