
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501706328764
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do ../code/estimate/correlations.do 

. here
/Users/koren/Tresorit/projects/expat-dyadic/

. local here = r(here)

. 
. use "`here'/temp/analysis_sample_dyadic.dta"

. keep frame_id_numeric year country export manager owner time_foreign teaor08_
> 2d  

. drop if country=="XX"
(132,392 observations deleted)

. egen cc = group(country)

. 
. egen byte acquired_in_sample = max(time_foreign == 0), by(frame_id_numeric )

. tabulate acquired_in_sample 

acquired_in |
    _sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,780,088       87.50       87.50
          1 |    397,320       12.50      100.00
------------+-----------------------------------
      Total |  3,177,408      100.00

. keep if acquired_in_sample 
(2,780,088 observations deleted)

. drop acquired_in_sample 

. egen byte acquired_in_sample = max(time_foreign <= -1), by(frame_id_numeric )

. tabulate acquired_in_sample 

acquired_in |
    _sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    260,688       65.61       65.61
          1 |    136,632       34.39      100.00
------------+-----------------------------------
      Total |    397,320      100.00

. keep if acquired_in_sample 
(260,688 observations deleted)

. drop acquired_in_sample 

. 
. egen export_before = max(export & time_foreign < 0), by(frame_id_numeric coun
> try)

. 
. tabulate export_before export

export_bef |     (max) export
       ore |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,312      2,630 |   120,942 
         1 |     7,944      7,746 |    15,690 
-----------+----------------------+----------
     Total |   126,256     10,376 |   136,632 

. 
. tabulate manager export if time_foreign > 0 & !missing(time_foreign ), row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |     (max) export
   manager |         0          1 |     Total
-----------+----------------------+----------
         0 |    53,078      4,913 |    57,991 
           |     91.53       8.47 |    100.00 
-----------+----------------------+----------
         1 |       461        348 |       809 
           |     56.98      43.02 |    100.00 
-----------+----------------------+----------
     Total |    53,539      5,261 |    58,800 
           |     91.05       8.95 |    100.00 

. tabulate manager export if !export_before & time_foreign > 0 & !missing(time_
> foreign ), row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |     (max) export
   manager |         0          1 |     Total
-----------+----------------------+----------
         0 |    49,646      2,226 |    51,872 
           |     95.71       4.29 |    100.00 
-----------+----------------------+----------
         1 |       350        117 |       467 
           |     74.95      25.05 |    100.00 
-----------+----------------------+----------
     Total |    49,996      2,343 |    52,339 
           |     95.52       4.48 |    100.00 

. 
. reghdfe export manager owner export_before if time_foreign > 0 & !missing(tim
> e_foreign ), a(frame_id_numeric##year cc##year) cluster(frame_id_numeric )
(MWFE estimator converged in 2 iterations)

HDFE Linear regression                            Number of obs   =     58,800
Absorbing 2 HDFE groups                           F(   3,    612) =     103.83
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4179
                                                  Adj R-squared   =     0.3900
                                                  Within R-sq.    =     0.0746
Number of clusters (frame_id_numeric) =        613Root MSE        =     0.2229

                     (Std. err. adjusted for 613 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      export | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     manager |   .1252899   .0305909     4.10   0.000     .0652141    .1853657
       owner |   .1411375   .0206497     6.83   0.000     .1005846    .1816904
export_bef~e |   .2240169   .0166579    13.45   0.000     .1913034    .2567304
       _cons |   .0598406   .0018308    32.69   0.000     .0562452     .063436
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      2450        2450           0    *|
                 cc#year |       240           1         239     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. reghdfe export manager owner if !export_before & time_foreign > 0 & !missing(
> time_foreign ), a(frame_id_numeric##year cc##year) cluster(frame_id_numeric )
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     52,328
Absorbing 2 HDFE groups                           F(   2,    606) =      16.08
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2446
                                                  Adj R-squared   =     0.2040
                                                  Within R-sq.    =     0.0098
Number of clusters (frame_id_numeric) =        607Root MSE        =     0.1844

                     (Std. err. adjusted for 607 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      export | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     manager |   .1198145   .0384494     3.12   0.002     .0443043    .1953247
       owner |   .0862939   .0228366     3.78   0.000     .0414453    .1311425
       _cons |    .042205   .0004465    94.53   0.000     .0413282    .0430819
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      2426        2426           0    *|
                 cc#year |       240           1         239     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
end of do-file
