
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501706328764
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do ../code/estimate/correlations.do 

. here
/Users/koren/Tresorit/projects/expat-dyadic/

. local here = r(here)

. 
. use "`here'/temp/analysis_sample_dyadic.dta"

. keep frame_id_numeric year country export import manager owner time_foreign t
> eaor08_2d  

. drop if country=="XX"
(132,392 observations deleted)

. egen cc = group(country)

. 
. egen byte acquired_in_sample = max(time_foreign == 0), by(frame_id_numeric )

. tabulate acquired_in_sample 

acquired_in |
    _sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,780,088       87.50       87.50
          1 |    397,320       12.50      100.00
------------+-----------------------------------
      Total |  3,177,408      100.00

. keep if acquired_in_sample 
(2,780,088 observations deleted)

. drop acquired_in_sample 

. egen byte acquired_in_sample = max(time_foreign <= -1), by(frame_id_numeric )

. tabulate acquired_in_sample 

acquired_in |
    _sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    260,688       65.61       65.61
          1 |    136,632       34.39      100.00
------------+-----------------------------------
      Total |    397,320      100.00

. keep if acquired_in_sample 
(260,688 observations deleted)

. drop acquired_in_sample 

. 
. local timing time_foreign >= 0 & !missing(time_foreign)

. foreach X in export import {
  2.     egen `X'_before = max(`X' & time_foreign < 0), by(frame_id_numeric cou
> ntry)
  3.     tabulate `X'_before `X'
  4. 
.     reghdfe `X' manager owner `X'_before if `timing', a(frame_id_numeric##yea
> r cc##year) cluster(frame_id_numeric )
  5.     reghdfe `X' manager owner if !`X'_before & `timing', a(frame_id_numeri
> c##year cc##year) cluster(frame_id_numeric )
  6. }

export_bef |     (max) export
       ore |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,312      2,630 |   120,942 
         1 |     7,944      7,746 |    15,690 
-----------+----------------------+----------
     Total |   126,256     10,376 |   136,632 
(MWFE estimator converged in 2 iterations)

HDFE Linear regression                            Number of obs   =     76,296
Absorbing 2 HDFE groups                           F(   3,    728) =     141.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4271
                                                  Adj R-squared   =     0.4000
                                                  Within R-sq.    =     0.0904
Number of clusters (frame_id_numeric) =        729Root MSE        =     0.2153

                     (Std. err. adjusted for 729 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      export | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     manager |   .1163768    .027273     4.27   0.000     .0628337    .1699198
       owner |   .1432432   .0188153     7.61   0.000     .1063044     .180182
export_bef~e |   .2491834   .0153298    16.25   0.000     .2190875    .2792793
       _cons |   .0525856   .0016676    31.53   0.000     .0493118    .0558594
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      3179        3179           0    *|
                 cc#year |       264           1         263     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(dropped 13 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     67,965
Absorbing 2 HDFE groups                           F(   2,    722) =      18.35
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2344
                                                  Adj R-squared   =     0.1939
                                                  Within R-sq.    =     0.0093
Number of clusters (frame_id_numeric) =        723Root MSE        =     0.1731

                     (Std. err. adjusted for 723 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      export | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     manager |   .1035272   .0328888     3.15   0.002     .0389582    .1680963
       owner |   .0874532   .0203235     4.30   0.000     .0475529    .1273535
       _cons |   .0364219    .000371    98.17   0.000     .0356935    .0371503
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      3149        3149           0    *|
                 cc#year |       264           1         263     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

import_bef |     (max) import
       ore |         0          1 |     Total
-----------+----------------------+----------
         0 |   111,015      4,045 |   115,060 
         1 |    10,263     11,309 |    21,572 
-----------+----------------------+----------
     Total |   121,278     15,354 |   136,632 
(MWFE estimator converged in 2 iterations)

HDFE Linear regression                            Number of obs   =     76,296
Absorbing 2 HDFE groups                           F(   3,    728) =     322.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4326
                                                  Adj R-squared   =     0.4058
                                                  Within R-sq.    =     0.1126
Number of clusters (frame_id_numeric) =        729Root MSE        =     0.2592

                     (Std. err. adjusted for 729 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      import | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     manager |   .1826616   .0248711     7.34   0.000     .1338339    .2314892
       owner |    .138855   .0175778     7.90   0.000     .1043457    .1733643
import_bef~e |   .2923983   .0128576    22.74   0.000     .2671559    .3176406
       _cons |   .0807179   .0018569    43.47   0.000     .0770723    .0843635
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      3179        3179           0    *|
                 cc#year |       264           1         263     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(dropped 16 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     64,834
Absorbing 2 HDFE groups                           F(   2,    724) =      33.18
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2679
                                                  Adj R-squared   =     0.2271
                                                  Within R-sq.    =     0.0110
Number of clusters (frame_id_numeric) =        725Root MSE        =     0.2126

                     (Std. err. adjusted for 725 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      import | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     manager |    .232209   .0381203     6.09   0.000     .1573694    .3070485
       owner |   .0751913   .0210169     3.58   0.000       .03393    .1164527
       _cons |   .0600287   .0002972   202.01   0.000     .0594453    .0606121
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      3158        3158           0    *|
                 cc#year |       264           1         263     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. tabulate manager export if `timing', row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |     (max) export
   manager |         0          1 |     Total
-----------+----------------------+----------
         0 |    69,281      6,023 |    75,304 
           |     92.00       8.00 |    100.00 
-----------+----------------------+----------
         1 |       579        413 |       992 
           |     58.37      41.63 |    100.00 
-----------+----------------------+----------
     Total |    69,860      6,436 |    76,296 
           |     91.56       8.44 |    100.00 

. tabulate manager export if !export_before & `timing', row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |     (max) export
   manager |         0          1 |     Total
-----------+----------------------+----------
         0 |    64,897      2,500 |    67,397 
           |     96.29       3.71 |    100.00 
-----------+----------------------+----------
         1 |       451        130 |       581 
           |     77.62      22.38 |    100.00 
-----------+----------------------+----------
     Total |    65,348      2,630 |    67,978 
           |     96.13       3.87 |    100.00 

. 
end of do-file
