
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501706328764
  Licensed to: Miklós Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do ../code/estimate/correlations.do 

. here
/Users/koren/Documents/research/expat-dyadic/

. local here = r(here)

. 
. use "`here'/temp/analysis_sample_dyadic.dta"

. keep frame_id_numeric year country export import manager manager_comlang owne
> r owner_comlang language time_foreign teaor08_2d  

. drop if country=="XX"
(132,392 observations deleted)

. egen cc = group(country)

. 
. egen byte acquired_in_sample = max(time_foreign == 0), by(frame_id_numeric )

. tabulate acquired_in_sample 

acquired_in |
    _sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,780,088       87.50       87.50
          1 |    397,320       12.50      100.00
------------+-----------------------------------
      Total |  3,177,408      100.00

. keep if acquired_in_sample 
(2,780,088 observations deleted)

. drop acquired_in_sample 

. egen byte acquired_in_sample = max(time_foreign <= -1), by(frame_id_numeric )

. tabulate acquired_in_sample 

acquired_in |
    _sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    260,688       65.61       65.61
          1 |    136,632       34.39      100.00
------------+-----------------------------------
      Total |    397,320      100.00

. keep if acquired_in_sample 
(260,688 observations deleted)

. drop acquired_in_sample 

. 
. local timing time_foreign >= 0 & !missing(time_foreign)

. foreach X in export import {
  2.     egen `X'_before = max(`X' & time_foreign < 0), by(frame_id_numeric cou
> ntry)
  3.     tabulate `X'_before `X'
  4.     egen `X'_anywhere_before = max(`X'_before), by(frame_id_numeric)
  5. }

export_bef |     (max) export
       ore |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,312      2,630 |   120,942 
         1 |     7,944      7,746 |    15,690 
-----------+----------------------+----------
     Total |   126,256     10,376 |   136,632 

import_bef |     (max) import
       ore |         0          1 |     Total
-----------+----------------------+----------
         0 |   111,015      4,045 |   115,060 
         1 |    10,263     11,309 |    21,572 
-----------+----------------------+----------
     Total |   121,278     15,354 |   136,632 

. 
. rename manager ADDRESS

. rename language NATIONALITY

. generate byte LANGUAGE = NATIONALITY | manager_comlang 

. 
. foreach X in export import {
  2.     reghdfe `X' ADDRESS NATIONALITY LANGUAGE `X'_before if `timing', a(fra
> me_id_numeric##year cc##year) cluster(frame_id_numeric )
  3.     reghdfe `X' ADDRESS NATIONALITY LANGUAGE if !`X'_before & `timing', a(
> frame_id_numeric##year cc##year) cluster(frame_id_numeric )
  4.     reghdfe `X' ADDRESS NATIONALITY LANGUAGE if !`X'_anywhere_before & `ti
> ming', a(frame_id_numeric##year cc##year) cluster(frame_id_numeric )
  5. }
(MWFE estimator converged in 2 iterations)

HDFE Linear regression                            Number of obs   =     76,296
Absorbing 2 HDFE groups                           F(   4,    728) =      89.83
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4232
                                                  Adj R-squared   =     0.3959
                                                  Within R-sq.    =     0.0842
Number of clusters (frame_id_numeric) =        729Root MSE        =     0.2160

                     (Std. err. adjusted for 729 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      export | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     ADDRESS |   .1775574   .0255997     6.94   0.000     .1272992    .2278155
 NATIONALITY |   .0404302    .020437     1.98   0.048     .0003077    .0805527
    LANGUAGE |  -.0187203   .0122686    -1.53   0.127    -.0428065    .0053658
export_bef~e |    .253505   .0154138    16.45   0.000     .2232442    .2837658
       _cons |   .0543123   .0016959    32.02   0.000     .0509828    .0576418
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      3179        3179           0    *|
                 cc#year |       264           0         264     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(dropped 13 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     67,965
Absorbing 2 HDFE groups                           F(   3,    722) =       8.69
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2324
                                                  Adj R-squared   =     0.1918
                                                  Within R-sq.    =     0.0066
Number of clusters (frame_id_numeric) =        723Root MSE        =     0.1733

                     (Std. err. adjusted for 723 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      export | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     ADDRESS |   .1421534   .0308195     4.61   0.000     .0816468    .2026601
 NATIONALITY |   .0366469   .0176279     2.08   0.038     .0020388    .0712551
    LANGUAGE |  -.0245274   .0109765    -2.23   0.026    -.0460771   -.0029777
       _cons |   .0377472   .0004903    76.99   0.000     .0367847    .0387098
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      3149        3149           0    *|
                 cc#year |       264           0         264     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(MWFE estimator converged in 2 iterations)

HDFE Linear regression                            Number of obs   =     34,776
Absorbing 2 HDFE groups                           F(   3,    351) =       7.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.2383
                                                  Adj R-squared   =     0.1988
                                                  Within R-sq.    =     0.0129
Number of clusters (frame_id_numeric) =        352Root MSE        =     0.1200

                     (Std. err. adjusted for 352 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      export | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     ADDRESS |   .1399406   .0330642     4.23   0.000     .0749117    .2049695
 NATIONALITY |  -.0000594   .0168974    -0.00   0.997    -.0332923    .0331735
    LANGUAGE |  -.0170339   .0155688    -1.09   0.275    -.0476538    .0135861
       _cons |   .0174407   .0006535    26.69   0.000     .0161555    .0187259
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      1449        1449           0    *|
                 cc#year |       264           0         264     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(MWFE estimator converged in 2 iterations)

HDFE Linear regression                            Number of obs   =     76,296
Absorbing 2 HDFE groups                           F(   4,    728) =     215.89
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4312
                                                  Adj R-squared   =     0.4043
                                                  Within R-sq.    =     0.1103
Number of clusters (frame_id_numeric) =        729Root MSE        =     0.2595

                     (Std. err. adjusted for 729 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      import | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     ADDRESS |   .2059885   .0251448     8.19   0.000     .1566235    .2553535
 NATIONALITY |   .0835235   .0247135     3.38   0.001     .0350053    .1320417
    LANGUAGE |   .0096579   .0138275     0.70   0.485    -.0174887    .0368045
import_bef~e |   .2959268   .0127825    23.15   0.000     .2708318    .3210219
       _cons |   .0804109   .0019262    41.75   0.000     .0766293    .0841924
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      3179        3179           0    *|
                 cc#year |       264           0         264     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(dropped 16 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     64,834
Absorbing 2 HDFE groups                           F(   3,    724) =      23.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2689
                                                  Adj R-squared   =     0.2281
                                                  Within R-sq.    =     0.0124
Number of clusters (frame_id_numeric) =        725Root MSE        =     0.2125

                     (Std. err. adjusted for 725 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      import | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     ADDRESS |   .2197841   .0383824     5.73   0.000       .14443    .2951382
 NATIONALITY |   .0906202   .0255295     3.55   0.000     .0404995     .140741
    LANGUAGE |   .0052356   .0122414     0.43   0.669    -.0187973    .0292684
       _cons |   .0592332   .0005493   107.83   0.000     .0581547    .0603116
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      3158        3158           0    *|
                 cc#year |       264           0         264     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(MWFE estimator converged in 2 iterations)

HDFE Linear regression                            Number of obs   =     22,680
Absorbing 2 HDFE groups                           F(   3,    237) =      15.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.3464
                                                  Adj R-squared   =     0.3095
                                                  Within R-sq.    =     0.0390
Number of clusters (frame_id_numeric) =        238Root MSE        =     0.1597

                     (Std. err. adjusted for 238 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      import | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     ADDRESS |   .2527755   .0482004     5.24   0.000     .1578196    .3477314
 NATIONALITY |   .0831169   .0355876     2.34   0.020     .0130084    .1532253
    LANGUAGE |   .0149799   .0172685     0.87   0.387    -.0190395    .0489992
       _cons |     .03366   .0009282    36.26   0.000     .0318315    .0354885
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |       945         945           0    *|
                 cc#year |       264           0         264     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
end of do-file
