
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501706328764
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do ../code/estimate/correlations.do 

. here
/Users/koren/Tresorit/projects/expat-dyadic/

. local here = r(here)

. 
. use "`here'/temp/analysis_sample_dyadic.dta"

. keep frame_id_numeric year country export import Lmanager Lowner time_foreign
>  teaor08_2d  

. drop if country=="XX"
(132,392 observations deleted)

. egen cc = group(country)

. 
. egen byte acquired_in_sample = max(time_foreign == 0), by(frame_id_numeric )

. tabulate acquired_in_sample 

acquired_in |
    _sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,780,088       87.50       87.50
          1 |    397,320       12.50      100.00
------------+-----------------------------------
      Total |  3,177,408      100.00

. keep if acquired_in_sample 
(2,780,088 observations deleted)

. drop acquired_in_sample 

. egen byte acquired_in_sample = max(time_foreign <= -1), by(frame_id_numeric )

. tabulate acquired_in_sample 

acquired_in |
    _sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    260,688       65.61       65.61
          1 |    136,632       34.39      100.00
------------+-----------------------------------
      Total |    397,320      100.00

. keep if acquired_in_sample 
(260,688 observations deleted)

. drop acquired_in_sample 

. 
. local timing time_foreign >= 0 & !missing(time_foreign)

. foreach X in export import {
  2.     egen `X'_before = max(`X' & time_foreign < 0), by(frame_id_numeric cou
> ntry)
  3.     tabulate `X'_before `X'
  4. 
.     reghdfe `X' Lmanager Lowner `X'_before if `timing', a(frame_id_numeric##y
> ear cc##year) cluster(frame_id_numeric )
  5.     reghdfe `X' Lmanager Lowner if !`X'_before & `timing', a(frame_id_nume
> ric##year cc##year) cluster(frame_id_numeric )
  6. }

export_bef |     (max) export
       ore |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,312      2,630 |   120,942 
         1 |     7,944      7,746 |    15,690 
-----------+----------------------+----------
     Total |   126,256     10,376 |   136,632 
(MWFE estimator converged in 2 iterations)

HDFE Linear regression                            Number of obs   =     76,296
Absorbing 2 HDFE groups                           F(   3,    728) =     131.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4261
                                                  Adj R-squared   =     0.3990
                                                  Within R-sq.    =     0.0888
Number of clusters (frame_id_numeric) =        729Root MSE        =     0.2155

                     (Std. err. adjusted for 729 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      export | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    Lmanager |   .0975733   .0280446     3.48   0.001     .0425153    .1526312
      Lowner |   .1442874   .0213263     6.77   0.000      .102419    .1861559
export_bef~e |   .2502243      .0153    16.35   0.000      .220187    .2802616
       _cons |   .0526999   .0016779    31.41   0.000     .0494057    .0559941
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      3179        3179           0    *|
                 cc#year |       264           1         263     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(dropped 13 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     67,965
Absorbing 2 HDFE groups                           F(   2,    722) =      16.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2341
                                                  Adj R-squared   =     0.1936
                                                  Within R-sq.    =     0.0089
Number of clusters (frame_id_numeric) =        723Root MSE        =     0.1731

                     (Std. err. adjusted for 723 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      export | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    Lmanager |   .0909215   .0326822     2.78   0.006      .026758     .155085
      Lowner |   .0932471   .0231785     4.02   0.000     .0477418    .1387523
       _cons |   .0364233   .0003888    93.67   0.000     .0356599    .0371867
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      3149        3149           0    *|
                 cc#year |       264           1         263     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

import_bef |     (max) import
       ore |         0          1 |     Total
-----------+----------------------+----------
         0 |   111,015      4,045 |   115,060 
         1 |    10,263     11,309 |    21,572 
-----------+----------------------+----------
     Total |   121,278     15,354 |   136,632 
(MWFE estimator converged in 2 iterations)

HDFE Linear regression                            Number of obs   =     76,296
Absorbing 2 HDFE groups                           F(   3,    728) =     283.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4311
                                                  Adj R-squared   =     0.4042
                                                  Within R-sq.    =     0.1101
Number of clusters (frame_id_numeric) =        729Root MSE        =     0.2596

                     (Std. err. adjusted for 729 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      import | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    Lmanager |   .1527329   .0271864     5.62   0.000     .0993599     .206106
      Lowner |   .1389562   .0204373     6.80   0.000     .0988331    .1790794
import_bef~e |   .2926918   .0128849    22.72   0.000     .2673958    .3179878
       _cons |   .0810734    .001868    43.40   0.000     .0774061    .0847407
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      3179        3179           0    *|
                 cc#year |       264           1         263     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(dropped 16 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     64,834
Absorbing 2 HDFE groups                           F(   2,    724) =      25.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2662
                                                  Adj R-squared   =     0.2253
                                                  Within R-sq.    =     0.0087
Number of clusters (frame_id_numeric) =        725Root MSE        =     0.2129

                     (Std. err. adjusted for 725 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
      import | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    Lmanager |   .2000243   .0413772     4.83   0.000     .1187907     .281258
      Lowner |   .0829756   .0241158     3.44   0.001     .0356303    .1303208
       _cons |   .0602176   .0003134   192.15   0.000     .0596023    .0608329
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
             Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------------+---------------------------------------|
   frame_id_numeric#year |      3158        3158           0    *|
                 cc#year |       264           1         263     |
-----------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. tabulate Lmanager export if `timing', row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |     (max) export
  Lmanager |         0          1 |     Total
-----------+----------------------+----------
         0 |    69,275      6,038 |    75,313 
           |     91.98       8.02 |    100.00 
-----------+----------------------+----------
         1 |       585        398 |       983 
           |     59.51      40.49 |    100.00 
-----------+----------------------+----------
     Total |    69,860      6,436 |    76,296 
           |     91.56       8.44 |    100.00 

. tabulate Lmanager export if !export_before & `timing', row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |     (max) export
  Lmanager |         0          1 |     Total
-----------+----------------------+----------
         0 |    64,892      2,498 |    67,390 
           |     96.29       3.71 |    100.00 
-----------+----------------------+----------
         1 |       456        132 |       588 
           |     77.55      22.45 |    100.00 
-----------+----------------------+----------
     Total |    65,348      2,630 |    67,978 
           |     96.13       3.87 |    100.00 

. 
end of do-file
