-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/projects/expat-dyadic//output/firm_panel.log
  log type:  text
 opened on:   7 Feb 2022, 19:23:28

. 
. * keep only sample from balance-small - NOTE: had to restructure as we have t
> o keep foreign which is different in years - so no collapse this time
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//St92928.000001 not
    found)
file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//St92928.000001 saved
    as .dta format

. 
. use "`here'/input/ceo-panel/ceo-panel.dta", clear // QUESTION: what is owner

. rename person_id manager_id

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           484,550  
    -----------------------------------------

. count if first_year_of_firm == firm_birth // QUESTION: why not the same? - sa
> me for the last year
  235,424

. 
. * balance panel
. egen company_manager_id = group(frame_id manager_id)

. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1988 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(81,097 missing values generated)

. replace gap = 0 if missing(gap)
(81,097 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    476,318       98.30       98.30
          1 |      4,718        0.97       99.27
          2 |      1,238        0.26       99.53
          3 |        701        0.14       99.67
          4 |        420        0.09       99.76
          5 |        349        0.07       99.83
          6 |        210        0.04       99.88
          7 |        149        0.03       99.91
          8 |        112        0.02       99.93
          9 |         89        0.02       99.95
         10 |         63        0.01       99.96
         11 |         50        0.01       99.97
         12 |         37        0.01       99.98
         13 |         24        0.00       99.99
         14 |         25        0.01       99.99
         15 |         13        0.00       99.99
         16 |         12        0.00      100.00
         17 |          7        0.00      100.00
         18 |          6        0.00      100.00
         19 |          4        0.00      100.00
         20 |          3        0.00      100.00
         22 |          1        0.00      100.00
         24 |          1        0.00      100.00
------------+-----------------------------------
      Total |    484,550      100.00

. 
. * fill in gap if only 1-year long
. expand 1 + (gap == 1), generate(filled_in) // FIXME OR QUESTION: maybe second
>  year as well
(4,718 observations created)

. replace year = year - 1 if filled_in
(4,718 real changes made)

. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1988 to 2018, but with gaps
         Delta: 1 unit

. xtdescribe

company_manager_id:  1, 2, ..., 81097                        n =      81097
    year:  1988, 1989, ..., 2018                             T =         31
           Delta(year) = 1 unit
           Span(year)  = 31 periods
           (company_manager_id*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                         1       1       2         4         8      20      31

     Freq.  Percent    Cum. |  Pattern
 ---------------------------+---------------------------------
     1590      1.96    1.96 |  ..............................1
     1421      1.75    3.71 |  .............................11
     1282      1.58    5.29 |  ....1..........................
     1107      1.37    6.66 |  ............................111
     1006      1.24    7.90 |  ...........................1111
      887      1.09    8.99 |  .........................111111
      812      1.00    9.99 |  .....1.........................
      791      0.98   10.97 |  ..........................11111
      714      0.88   11.85 |  ....11.........................
    71487     88.15  100.00 | (other patterns)
 ---------------------------+---------------------------------
    81097    100.00         |  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX

. 
. * create contiguous spells
. gen change = ceo != L.ceo 

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat found
> er insider outsider firm_birth foreign country_code

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(36,744 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,514

. 
. * expat before 1990
. replace expat = 0 if job_begin < 1990
(60 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
.         by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job
> _begin,.))
(373,409 missing values generated)

.         by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1,
>  year,.))
(347,822 missing values generated)

.         
.         * which of the two happened first?
.         generate manager_after_owner = first_year_expat - first_year_foreign
(383,603 missing values generated)

.         * event time relative to that
.         generate event_time = year - first_year_expat
(373,409 missing values generated)

.         
.         * if foreign manager arrives up to 2 years before 1 year later than f
> oreign owner, use foreign manager as arrival date. this is easier to implemen
> t
.         replace foreign = 1 if (manager_after_owner == -2) & inlist(event_tim
> e, 0, 1)
(206 real changes made)

.         replace foreign = 1 if (manager_after_owner == -1) & inlist(event_tim
> e, 0)
(184 real changes made)

.         replace foreign = 0 if (manager_after_owner == +1) & inlist(event_tim
> e, -1)
(326 real changes made)

. 
.         * QUESTION: order of deletions (may be fine as all are firm level)
.         * drop firms where expat arrives earlier than 2 years before owner
.         drop if manager_after_owner < -2
(3,840 observations deleted)

.         
.         * ever expat and foreign created after foreign changes (drops were fi
> rm level before so should not mess with ever variables)
.         foreach X of var expat foreign {
  2.                 by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3.         }

. 
.         * drop if there was an expat but was never foreign
.         drop if ever_expat == 1 & ever_foreign == 0
(10,217 observations deleted)

.         scalar dropped_do3_expat_firmyears = r(N_drop)

.         
.         * drop too many CEO-s - FIXME AND QUESTION: should be moved in the ne
> xt file where spells are limited - but there cannot be created without manage
> r level data
.         egen fp_tag = tag(frame_id_numeric manager_id) 

.         by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

.         drop if n_ceo > 15
(7,609 observations deleted)

.         scalar dropped_too_many_CEOs = r(N_drop)

.         drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm - * POSSIBLE FIXME: exp
> at, owner, insider, outsider, founder - hire, fire combinations later
. tempvar previous_year

. generate previous_year = .
(467,602 missing values generated)

. forval t = 1985/2018 {
  2.         by frame_id_numeric: egen `previous_year' = max(cond(year < `t', y
> ear, .))
  3.         replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }
(467,602 missing values generated)
(0 real changes made)
(467,602 missing values generated)
(0 real changes made)
(467,602 missing values generated)
(0 real changes made)
(467,602 missing values generated)
(0 real changes made)
(431,259 missing values generated)
(1,994 real changes made)
(430,088 missing values generated)
(2,088 real changes made)
(393,434 missing values generated)
(4,495 real changes made)
(354,181 missing values generated)
(6,711 real changes made)
(290,082 missing values generated)
(9,889 real changes made)
(242,039 missing values generated)
(11,871 real changes made)
(207,926 missing values generated)
(12,924 real changes made)
(184,892 missing values generated)
(13,423 real changes made)
(162,247 missing values generated)
(14,087 real changes made)
(137,836 missing values generated)
(15,066 real changes made)
(120,323 missing values generated)
(15,533 real changes made)
(107,101 missing values generated)
(15,771 real changes made)
(92,179 missing values generated)
(16,179 real changes made)
(79,071 missing values generated)
(16,539 real changes made)
(67,702 missing values generated)
(16,721 real changes made)
(59,487 missing values generated)
(17,018 real changes made)
(51,613 missing values generated)
(17,215 real changes made)
(44,177 missing values generated)
(17,356 real changes made)
(36,970 missing values generated)
(17,467 real changes made)
(31,051 missing values generated)
(18,123 real changes made)
(24,954 missing values generated)
(17,895 real changes made)
(20,106 missing values generated)
(17,772 real changes made)
(15,686 missing values generated)
(17,669 real changes made)
(11,749 missing values generated)
(17,569 real changes made)
(8,719 missing values generated)
(17,577 real changes made)
(5,946 missing values generated)
(17,263 real changes made)
(3,766 missing values generated)
(16,484 real changes made)
(2,150 missing values generated)
(16,279 real changes made)
(970 missing values generated)
(16,250 real changes made)
(278 missing values generated)
(15,743 real changes made)

. 
. by frame_id_numeric: egen first_year = min(year)

. bys frame_id_numeric (year): generate byte hire = cond(first_year == year, 1,
>  (job_begin <= year) & (job_begin > previous_year))

. 
. tempvar next_year

. generate next_year = .
(467,602 missing values generated)

. forval t = 1985/2018 {
  2.         by frame_id_numeric: egen `next_year' = min(cond(year > `t', year,
>  .))
  3.         replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(5 missing values generated)
(2,013 real changes made)
(15 missing values generated)
(2,095 real changes made)
(80 missing values generated)
(4,603 real changes made)
(742 missing values generated)
(6,946 real changes made)
(3,500 missing values generated)
(10,148 real changes made)
(6,703 missing values generated)
(11,882 real changes made)
(10,228 missing values generated)
(13,063 real changes made)
(13,848 missing values generated)
(13,504 real changes made)
(17,697 missing values generated)
(14,124 real changes made)
(21,678 missing values generated)
(14,911 real changes made)
(25,872 missing values generated)
(15,579 real changes made)
(31,758 missing values generated)
(15,638 real changes made)
(36,882 missing values generated)
(16,180 real changes made)
(41,968 missing values generated)
(16,503 real changes made)
(47,798 missing values generated)
(16,747 real changes made)
(54,087 missing values generated)
(16,759 real changes made)
(61,036 missing values generated)
(17,038 real changes made)
(67,936 missing values generated)
(17,176 real changes made)
(75,860 missing values generated)
(17,280 real changes made)
(84,021 missing values generated)
(17,329 real changes made)
(93,731 missing values generated)
(17,848 real changes made)
(103,027 missing values generated)
(17,654 real changes made)
(111,759 missing values generated)
(17,582 real changes made)
(120,625 missing values generated)
(17,532 real changes made)
(128,332 missing values generated)
(17,409 real changes made)
(139,082 missing values generated)
(17,289 real changes made)
(155,696 missing values generated)
(16,583 real changes made)
(165,929 missing values generated)
(16,208 real changes made)
(174,832 missing values generated)
(16,068 real changes made)
(190,261 missing values generated)
(15,611 real changes made)
(467,602 missing values generated)
(0 real changes made)

. 
. gen byte fire = ((job_end >= year) & (job_end < next_year))

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   325,530     62,577 |   388,107 
         1 |    62,577     16,918 |    79,495 
-----------+----------------------+----------
     Total |   388,107     79,495 |   467,602 

. 
. gen hire_expat = hire * expat

. gen fire_expat = fire * expat

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat = total(cond(expat, 1, 0)) // could b
> e in collapse but local not

. bys frame_id_numeric year: egen n_local = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. * FIXME: country_code may be different within a firm-year
. collapse (sum) n_founder = founder n_insider = insider n_outsider = outsider 
> (firstnm) n_expat n_local foreign ever_expat ever_foreign (count) n_ceo = exp
> at (max) hire_ceo = hire fire_ceo = fire hire_expat fire_expat, by(frame_id_n
> umeric year)

. 
. * managers in first year not classified as new hires and in last year not cla
> ssified as fired
. bys frame_id_numeric (year): replace hire_ceo = 0 if (_n==1)
(27,193 real changes made)

. bys frame_id_numeric (year): replace fire_ceo = 0 if (_n==_N)
(27,193 real changes made)

. bys frame_id_numeric (year): replace hire_expat = 0 if (_n==1)
(2694 real changes made)

. bys frame_id_numeric (year): replace fire_expat = 0 if (_n==_N)
(2810 real changes made)

. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo | fire_ceo) + 1 // 
> so that index start from 1

. 
. * create dummies from numbers
. foreach var in expat local founder insider outsider {
  2.         gen has_`var' = (n_`var' > 0)
  3. }

. 
. * merge on manager_countries
. merge 1:1 frame_id_numeric year using "`here'/temp/manager_country.dta", keep
> (master match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                       292,558
        from master                   292,558  
        from using                          0  

    Matched                            36,353  
    -----------------------------------------

. tabulate has_expat if missing(country_list)

  has_expat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    290,872       99.42       99.42
          1 |      1,686        0.58      100.00
------------+-----------------------------------
      Total |    292,558      100.00

. tabulate has_expat if !missing(country_list)

  has_expat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        682        1.88        1.88
          1 |     35,671       98.12      100.00
------------+-----------------------------------
      Total |     36,353      100.00

. rename country_list country_all_manager

. rename language_list lang_all_manager

. 
. count
  328,911

. 
. compress
  variable n_expat was float now byte
  variable n_local was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable hire_expat was float now byte
  variable fire_expat was float now byte
  variable ceo_spell was float now byte
  variable has_expat was float now byte
  variable has_local was float now byte
  variable has_founder was float now byte
  variable has_insider was float now byte
  variable has_outsider was float now byte
  variable n_founder was double now byte
  variable n_insider was double now byte
  variable n_outsider was double now byte
  variable country_all_manager was str15 now str12
  (20,721,393 bytes saved)

. save "`here'/temp/firm_events.dta", replace
(file /Users/koren/Tresorit/projects/expat-dyadic//temp/firm_events.dta not
    found)
file /Users/koren/Tresorit/projects/expat-dyadic//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/projects/expat-dyadic//output/firm_panel.log
  log type:  text
 closed on:   7 Feb 2022, 19:24:31
-------------------------------------------------------------------------------
